nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f83000evk/driver_examples/queued_spi/polling_flash/pin_mux.c
/*
 * Copyright 2023 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v13.0
processor: MC56F83789
package_id: MC56F83789VLL
mcu_data: ksdk2_0
processor_version: 0.13.4
board: MC56F83000-EVK
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '3', peripheral: OCCS, signal: EXTAL, pin_signal: GPIOC0/EXTAL/CLKIN0}
  - {pin_num: '4', peripheral: OCCS, signal: XTAL, pin_signal: GPIOC1/XTAL}
  - {pin_num: '9', peripheral: QSCI2, signal: TXD, pin_signal: GPIOD6/TXD2/XB_IN4/XB_OUT8}
  - {pin_num: '10', peripheral: QSCI2, signal: RXD, pin_signal: GPIOD5/RXD2/XB_IN5/XB_OUT9}
  - {pin_num: '95', peripheral: QSPI1, signal: SS, pin_signal: GPIOF7/TB3/CMPC_O/SS1_B/XB_IN3}
  - {pin_num: '55', peripheral: QSPI1, signal: SCLK, pin_signal: GPIOF0/XB_IN6/TB2/SCLK1}
  - {pin_num: '48', peripheral: QSPI1, signal: MOSI, pin_signal: GPIOG11/TB3/CLKO0/MOSI1}
  - {pin_num: '47', peripheral: QSPI1, signal: MISO, pin_signal: GPIOD7/XB_OUT11/XB_IN7/MISO1}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* GPIOC IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOC);
    /* GPIOD IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOD);
    /* GPIOF IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOF);
    /* GPIOG IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOG);
    /* Enable peripheral functionality on pin GPIOC0 (pin 3) */
    GPIO_PinSetPeripheralMode(BOARD_EXTAL_GPIO, BOARD_EXTAL_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC0 (pin 3) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C0_EXTAL);
    /* Enable peripheral functionality on pin GPIOC1 (pin 4) */
    GPIO_PinSetPeripheralMode(BOARD_XTAL_GPIO, BOARD_XTAL_PIN_MASK, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOD5 (pin 10) */
    GPIO_PinSetPeripheralMode(BOARD_RXD_BDM_GPIO, BOARD_RXD_BDM_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOD5 (pin 10) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_D5_RXD2);
    /* Enable peripheral functionality on pin GPIOD6 (pin 9) */
    GPIO_PinSetPeripheralMode(BOARD_TXD_BDM_GPIO, BOARD_TXD_BDM_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOD6 (pin 9) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_D6_TXD2);
    /* Enable peripheral functionality on pin GPIOD7 (pin 47) */
    GPIO_PinSetPeripheralMode(BOARD_SPI_FLASH_MISO_GPIO, BOARD_SPI_FLASH_MISO_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOD7 (pin 47) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_D7_MISO1);
    /* Enable peripheral functionality on pin GPIOF0 (pin 55) */
    GPIO_PinSetPeripheralMode(BOARD_SPI_FLASH_SCLK_GPIO, BOARD_SPI_FLASH_SCLK_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOF0 (pin 55) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_F0_SCLK1);
    /* Enable peripheral functionality on pin GPIOF7 (pin 95) */
    GPIO_PinSetPeripheralMode(BOARD_SPI_FLASH_SS_GPIO, BOARD_SPI_FLASH_SS_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOF7 (pin 95) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_F7_SS1_B);
    /* Enable peripheral functionality on pin GPIOG11 (pin 48) */
    GPIO_PinSetPeripheralMode(BOARD_SPI_FLASH_MOSI_GPIO, BOARD_SPI_FLASH_MOSI_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOG11 (pin 48) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_G11_MOSI1);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
